app/controllers/artists_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 6]]
---
  def edit
    if params[:song_id]
      @song = Song.find_by(:id => params[:song_id])
      if @song.nil?
        redirect_to songs_path, flash[:alert] = "Song not found."
      else
        @artist = @song.artists.find_by(id: params[:id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 6]]
---
  def update
    @artist = Artist.find(params[:id])