app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1]]
---
  def edit
    if params[:artist_id]
      @nested = true
      @artist = Artist.find_by(:id => params[:artist_id])
      if @artist.nil?
        flash[:alert] = "Artist not found."
        redirect_to artists_path
      else
        @song = @artist.songs.find_by(:id => params[:id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "songs" SET "title" = ?, "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["title", "Mr. Brightsides"], ["artist_id", 8], ["updated_at", "2018-02-24 03:28:23.361804"], ["id", 1]]
---
  def update
    @song = Song.find(params[:id])

    @song.update(song_params)